#დავალება 1

# print 5 + 3
# ამ კოდში არის ის შეცდომა რომ აკლია ფრჩხილები

# print(balance)
# შეცდომაა რადგან ბალანსის ცვლადი არ არის გამოძახებული

# print(revenue)
# revenue = 300
# შეცდომაა რადგან ცვლადის გამოძახება ხდება ცვლადის გამოძახებამდე




#დავალება 2

# Debugger არის მნიშვნელოვანი ისტრუნმენტი რომელიც ამარტივებს 
# პროგრამების პროცესს და ამცირებს შეცდომების პოვნისა და გამოსწორების დროს.




#დავალება 3

#სწორი გზა

# name = "giorgi"
# print(name)


#არასწორი გზა

# name = giorgi
# print giorgi

#ეს კოდი იმიტომაა არასწორი რომ ცვლადში მინიჭებულ სახელს აკლია ბრჭყალები ხოლო print ფუნქციას აკლია ფრჩხილები






#დავალება 4

#სწორი გზა

# academy = "GOA is the best academy in georgia"
# print(academy)
# ეს კოდი იმიტომაა სწორი რომ ცვლადიში გამოძახებული სახელი ჩასმულია ბრჭყაებში


#არასწორი გზა

# academy  "GOA is the best academy in georgia"
# print(academy)
# ეს კოდი იმიტომაა არასწორი რომ ცვლადს აკლია ტოლობის ნიაშანი